namespace MoneyToWords.Infrastructure

open MoneyToWords.Domain

/// <summary>
/// Правила языка для русского.
/// </summary>
[<RequireQualifiedAccess>]
module RussianRules =

    /// <summary>
    /// Правила для русского языка.
    /// </summary>
    let Value: ILanguageRules = {
        UnitsMasc = [| "ноль"; "один"; "два"; "три"; "четыре"; "пять"; "шесть"; "семь"; "восемь"; "девять" |]
        UnitsFem  = [| "ноль"; "одна"; "две"; "три"; "четыре"; "пять"; "шесть"; "семь"; "восемь"; "девять" |]
        Teens = [| "десять"; "одиннадцать"; "двенадцать"; "тринадцать"; "четырнадцать"; "пятнадцать"; "шестнадцать"; "семнадцать"; "восемнадцать"; "девятнадцать" |]
        Tens = [| ""; ""; "двадцать"; "тридцать"; "сорок"; "пятьдесят"; "шестьдесят"; "семьдесят"; "восемьдесят"; "девяносто" |]
        Hundreds = [| ""; "сто"; "двести"; "триста"; "четыреста"; "пятьсот"; "шестьсот"; "семьсот"; "восемьсот"; "девятьсот" |]
        Ranks = [|
            Form("тысяча", "тысячи", "тысяч")
            Form("миллион", "миллиона", "миллионов")
            Form("миллиард", "миллиарда", "миллиардов")
            Form("триллион", "триллиона", "триллионов")
            Form("квадриллион", "квадриллиона", "квадриллионов")
        |]
        Currency = Form("рубль", "рубля", "рублей")
        Subunit = Form("копейка", "копейки", "копеек")
        Conjunction = " и "
    }